days_n_numbers = {1:["အ","ဥ"],
                  2:["က","ခ","ဂ","ဃ","င"],
                  3:["စ","ဆ","ဇ","ဈ","ည"],
                  4:["ယ","လ","ဝ"],
                  5:["ပ","ဖ","ဗ","ဘ","မ"],
                  6:["သ","ဟ"],
                  7:["တ","ထ","ဒ","ဓ","န"],
                  8:["ရ"]
                  }
keys = list(days_n_numbers.keys())

names_count = int(input("နာမည် ဘယ်နှလုံး ရှိပါသလဲ : "))
name_array = []
sum = 0

for i in range(0,names_count):
    name = input("သင့် နာမည် အစ စကားလုံးအား မြန်မာလို ရိုက်ထည့်ပါ : ")
    for key in days_n_numbers:
            if name in days_n_numbers[key]:
                sum = sum + key

sum = sum + 7
remainder = sum % 9

if remainder == 1:
    print("သူဆင်းရဲကိန်း (မိမိကြိုးစားသလောက် မခံစားရသူ)")
elif remainder == 2:
    print("သူဌေးကိန်း (ငွေသုံးကြမ်းသူ၊ အမြဲငွေပြတ်နေတတ်ပြီး အမှန်တကယ် အသုံးလိုချိန်တွင်လည်း ရရှိတတ်သူ)")
elif remainder == 3:
    print("သူခိုးကိန်း")
elif remainder == 4:
    print("မင်းကိန်း (ဩဇာရှိသူ၊ ထက်မြတ်သူ)")
elif remainder == 5:
    print("မိဖုရားကိန်း (ကြီးမြတ်သူ ပံ့ပိုးမှုဖြင့် အောင်မြင်သူ)")
elif remainder == 6:
    print("ဘီလူးကိန်း (ကြမ်းတမ်းသူ၊ ဘဝအတက်အကျမြန်သူ)")
elif remainder == 7:
    print("အမတ်ကိန်း (မျှတသူ၊ အပေါင်းအသင်းများအား အကြံဉာဏ်ကောင်းပေးတတ်သူ)")
elif remainder == 8:
    print("ပုဏ္ဏားကိန်း (အတ္တကြီးသူ၊ တစ်ကိုယ်ကောင်းဆန်သူ၊ မိမိကောင်းကျိုးအတွက် မည်သူ့ကိုမျှ မငဲ့ကွက်သူ)")
elif remainder == 0:
    print("ရဟန်းကိန်း (အကောင်းဆုံး ပုဂ္ဂိုလ်)")

